// @path: @/app/book/chapter1/chapter1.ts
import { ModuleBuilder } from '@/builder/builder';

export const yusya1Module = ModuleBuilder.create('Сніг іде зі Снігокраю', `y1`)
  .addEntryScene({
    description: `Всю ніч 🌟🌒 за вікном падав великий лапатий сніг. 🌨️🌨️ Його було так багато ❄️☃️, що навіть довелося відмінити навчання у школі 🏫, на яке мав іти хлопчик Вадимчик 🧏‍♂️.
    Звісно, він трохи засмутився 😕, тому що йому подобалося ходити до школи. Проте сумував він зовсім не довго, адже мама 👩 запропонувала йому піти погуляти у дворі.`,
    id: '1',
  })
  .addSceneChoices({
    description: `Вадимчик одягнув улюблену шапку 💂‍♂️ та рукавички 🧤. Взяв ключі 🔑, відчинив двері та пішов гуляти. А мама побігла 🏃‍♀️ слід за ним.`,
    nextSceneId: '2',
  })
  .addScene({
    description: `Неподалік будиночку 🏚️ була дитяча площадка. Тут всі діти 👬 любили бавитися 🤼‍♀️. Тож, не гаючи часу 🕛, Вадим із мамою 👩‍👦 попрямували туди. Під ногами рипів сніг 🥾❄️, щічки укрив рум'янець 😊. Незабаром вони побачили чудову гірку зі снігу 🏔️, і мама 👩 спитала Вадимку:
    - Ну що, хочеш покататися з гірки? ⛰️ Звідки ти будеш спускатися? 🏞️`,
    id: '2',
  })
  .addSceneChoices({
    description: 'Вадим обрав невеличкий горбочок. 🏔️',
    nextSceneId: '3-1',
  })
  .addSceneChoices({
    description: 'Вадим вирішив підкорити вершину. 🗻',
    nextSceneId: '3-2',
  })
  .addChoiceAction({
    operator: 'set',
    target: 'tophill',
    value: 1,
  })
  .addScene({
    description: `Вадимка був обережною дитиною, тож обрав перевірений варіант - маленький горбочок 🏔️. Вони швиденько піднялися на гірку і підготувалися до спуску. Вадим приготувався і скомандувала:`,
    id: '3-1',
  })
  .addSceneChoices({
    description: `- Побігли тихенько!`,
    nextSceneId: '4',
  })
  .addScene({
    description: `В цей раз вершечок гори не виглядав аж надто високим, тож не гаючи часу Юся з мамою піднялися на гору. 
    Звідти був чудовий краєвид на засніжене місто, але Юсю цікавило інше - це був її перший спуск з самісінької вершини гори. Вона міцно вхопилася за санчата і скомандувада:`,
    id: '3-2',
  })
  .addSceneChoices({
    description: `- Побігли швиденько!`,
    nextSceneId: '4',
  })
  .addScene({
    description: `Вони стрімко розігналися по свіжому снігу ⛷️. Вітер весело співав підбадьорюючи хороброго хлопчика. А мама ледь не верещала від захоплення 🥳. 
    Аж раптом, чобіток Вадима наступив на крижаний горбик. Його відкинуло в сторону 🤸 і він м'ячиком влетів у запорошені снігом кущі 🤸‍♂️. 
    Снігу було так багато, що йому було зовсім не боляче. Лише трішки шкода, що стрімкий спуск урвався на самому цікавому. 
    Він вже збирався покликати маму, аж раптом почув голос 🧙`,
    id: '4',
  })
  .addSceneChoices({
    description: '- Дивіться який великий хлопчинка!',
    nextSceneId: '5',
  })
  .addScene({
    description: `Вадим повернув голову, але спершу нікого не побачив. Лише придивившись 🧐, він помітив трьох маленьких чоловічків 👨‍👦‍👦 одягнених у сліпучо-білі шубки та та величенькі шапки 🎩. 
    Ці чоловічки були геть маленькі, не більше середнього пальця дорослого, але разом зі своїми чудернацькими шапками 🎩 були майже з долоньку. 🖐️`,
    id: '5',
  })
  .addSceneChoices({
    description: `- Хто ви такі?, - запитав Вадим`,
    nextSceneId: '6-1',
  })
  .addSceneChoices({
    description: `- Мамо, йди сюди! - покликав Вадим`,
    nextSceneId: '6-2',
  })
  .addScene({
    description: `Вадим хотів спитати у чоловічків, хто вони такі. Але мама була вже тут як тут 👩, щоб допомогти своєму хлопчику 💪. 
    Тож Вадим показав  мамі на чоловічків 👉`,
    id: '6-1',
  })
  .addSceneChoices({
    description: `Але мама нічого не побачила...`,
    nextSceneId: `7`,
  })
  .addScene({
    id: '6-2',
    description: `Вадим ніколи не бачила таких дивних створінь 🧙, тож про всяк випадок вирішив покликати маму. 
    Вадим був розумним і обережним хлопчиком і розумів, що іноді допомога дорослих не завадить. 
    Менше ніж за хвилину мама вже була на місці аварії і Вадим показав мамі на чоловічків.`,
  })
  .addSceneChoices({
    nextSceneId: `7`,
    description: `Але мама нічого не побачила...`,
  })
  .addScene({
    description: `- Дивись які смішні чоловічки! 🧙‍♂️ Які у них смішні шапки! 🧙‍♂️
    - 👸 Де? Про кого ти кажеш?
    - 👳 Ну он, дивись, під кущем. Троє чоловічків у шубах.
    
    Мама уважно подивилася під кущ, але так нікого й не помітила. Вона швиденько обтрусила Вадимку, підняла рукавички, і запропонувала піти на початок гірки. 
    Але Вадиму так кортіло дізнатися більше про чоловічків, що він захотів залишитися тут. Щойно мама пішла, Вадим чемно проказав:`,
    id: `7`,
  })
  .addSceneChoices({
    description: `- Мене звати веселий Вадим, а вас?`,
    nextSceneId: `8`,
  })
  .addScene({
    description: `Чоловічки перезирнулися між собою і найтовщий з них поважно промовив 🧕:
    - Ми Сніжики - мобільна супергрупа, що слідкує за якістю снігу. Наше завдання, щоб сніг був ідеальної товщини для зручного катання і гарно рипів під ногами, а не чвакав чи хлюпав.
    Вадим закліпав очима і запитав:`,
    id: '8',
  })
  .addSceneChoices({
    description: `- А через що ж я тоді перечепився?`,
    nextSceneId: `9`,
  })
  .addScene({
    id: `9`,
    description: `Один зі Сніжиків знітився, і пробурмотів:
    - Просто щось пішло не так, але якщо ви зачекаєте і спробуєте ще раз, буде краще - я обіцяю!
    Товстенький Сніжик повернувся до говіркого і промовив:
    - Як ти збираєшся виконувати свою обіцянку, якщо ми тут застрягли без транспорту? А вікно зачинається вже за три доби...
    Юся подумала хвильку і запитала:`,
  })
  .addSceneChoices({
    description: `- То ви тут застрягли? А звідки ви? З Лапландії чи може з Ісландії?`,
    nextSceneId: `10`,
  })
  .addScene({
    id: `10`,
    description: `- Лапландія? То вигадки! А в Ісландії зараз взагалі вулкан пробуджується, ми туди ні ногою! - Відповів товстенький Сніжик.
    - Ми зі Снігокраю, - неочікувано проговорив третій Сніжик, точніше Сніжка, тому що це була дівчина. - Мене звати Снілея, я керівник цього проекту. Він, - вона показала на товстенького, - Олег і перевіряє якість снігу. А це наш розробник і має виправляти помилки, які, на жаль, інколи трапляються з розрахунками. Власне через нашу помилку ти й перечипилася, вибач за це.`,
  })
  .addSceneChoices({
    description: `Юся була ввічливою дівчинкою, тому вона відповіла:`,
    nextSceneId: `11`,
  })
  .addScene({
    description: `- Не треба вибачатися, я завжди думала, що воно все якось саме...
    - Ніщо гарне ніколи не робиться саме. Для всього треба докласти зусиль, а іноді й чималих. - упевнено промовив Олег.
    Юся задумалася над словами товстенького Сніжика, аж тут вона пригадала, що ці дивні чоловічки тут застрягли. Тож вона відкинула цю складну думку і запитала:`,
    id: '11',
  })
  .addSceneChoices({
    nextSceneId: '12',
    description: '- То ви тут застрягли? Як так?',
  })
  .addScene({
    description: `- Через непорозуміння. Наша заявка на перевірку снігу не була вчасно опрацьована командою вітру і вони не знали, що ми будемо тут. Тому вітер був такий сильний, що нас викинуло з кулі і ми врятувалися лише завдяки аварійним пристроям, які ми завжди носимо з собою. А тепер нам треба вчасно повернутися додому, щоб на Різдво був гарний сніг.`,
    id: '12',
  })
  .addSceneChoices({
    description: `- А де ваш дім?`,
    nextSceneId: `13`,
  })
  .addScene({
    description: `- Наш Снігокрай високо в небі, вкритий густими і пухкими хмарами, які ви, люди, називаєте шарувато-дощовими. Вони закривають наш світ від занадто цікавих очей і дають густий та м'який сніг найвищої якості, яким так приємно кататися взимку. Але дістатися туди не просто. Не існує такої драбини щоб піднятися на цю висоту.
    Юся подивилася на підніжжя пагорба і побачила маму яка вже піднімалася із санчатами до неї. Їй сяйнула думка:`,
    id: '13',
  })
  .addSceneChoices({
    description: `- Можливо мої батьки зможуть вам допомогти? Вони найрозумніші люди в світі!`,
    nextSceneId: '14',
  })
  .addScene({
    description: `Всі троє сніжиків сумно захитали головою.
    - Дорослі не бачать нас і не чують. Лише такі діти як ти, що вірять у пригоди та зимові казки, можуть спілкуватися з нами. Тому допомогти нам можеш лише ти.
    Мама майже дісталася Юсі і Юся прошепотіла:`,
    id: `14`,
  })
  .addSceneChoices({
    description: `- Стрибайте в санчата!`,
    nextSceneId: `15`,
  })
  .addScene({
    id: '15',
    description: `Увесь день Юся перебирала свої іграшки щоб знайти бодай щось, що може дістатися Снігокраю. Зрештою, вона відібрала велитенську рогачку, літачок на резиновому моторі, подарований цього літа її хресним, та гелікоптер на радіо керуванні від дядька. Все це вона вирішила запропонувати Сніжикам, аджек кому, як не їм, було краще знати, чим дістатися домівки`,
  })
  .addSceneChoices({
    nextSceneId: `15-1`,
    description: '- Я можу стрельнути вами в хмару з рогачки',
  })
  .addSceneChoices({
    nextSceneId: `15-2`,
    description: '- Давайте візьмемо літак - він далеко летить',
  })
  .addSceneChoices({
    nextSceneId: `15-3`,
    description: '- Можливо візьмемо гелікоптер?',
  })
  .addScene({
    id: '15-1',
    description: `Сніжики невпевнено перезирнулися. Схоже, що вони тільки зараз зрозуміли, що мають справу з маленькою дівчинкою, яка ще не встигла опанувати балістику, аеродинаміку та інші розумні науки, які могли б стати зараз у нагоді. 
    - Боюся, що рогачка просто не зможе підкинути нас так високо як нам треба. Та й прискорення... - Снілея  урвала сама себе і додала: - Це не підходить!`,
  })
  .addSceneChoices({
    nextSceneId: `15-2`,
    description: '- Давайте візьмемо літак - він далеко летить',
  })
  .addSceneChoices({
    nextSceneId: `15-3`,
    description: '- Можливо візьмемо гелікоптер?',
  })
  .addScene({
    id: '15-2',
    description: `- Літак це цікаво,- промовив сніго-програміст, який так досі й не представився. - Але ж він не керований і летить лише прямо? А нам потрібно вгору. На жаль, цей варіант не підходить. - з сумом додав він`,
  })
  .addSceneChoices({
    nextSceneId: `15-1`,
    description: '- Я можу стрельнути вами в хмару з рогачки',
  })
  .addSceneChoices({
    nextSceneId: `15-3`,
    description: '- Можливо візьмемо гелікоптер?',
  })
  .addScene({
    id: '15-3',
    description: `Почувши цю ідею Сніжики зраділи. 
    - Гелікопетри можуть літати вертикально вгору і ми зможемо приторочити до нього якусь торбинку для нас. Ти дуже гарно придумала, Юсю. - сказала Снілея`,
  })
  .addSceneChoices({
    description: `Випробування було призначено на завтра і обов'язково мало принести успіх, адже на кону стояв сніг на Різдво.`,
    nextSceneId: '16',
  })
  .addScene({
    id: `16`,
    description: `Ранок виявився чудовим. Сяяло яскраве сонце, сніг блищав і милував око. Був легкий морозець через який так чітко видно навколишній світ, неначе хтось надягнув окуляри. Навчання ще не відновили, бо, як сказав Юсин тато, хтось не придбав до зими сіль. Юся не дуже зрозуміла до чого тут сіль, але це цілком відповідало її планам. Адже сьогодні був день польотів. 
    Юся швиденько зібралася, навіть по погоді, тож мама була дуже задоволена.`,
  })
  .addSceneChoices({
    description: `Усього через годину після сніданку вони вже їхали на гірку`,
    nextSceneId: `17-2`,
  })
  .addScene({
    id: `17-2`,
    description: `Cьогодні Юся наважилася піднятися на найвищу точку гірки, адже від неї залежали інші. Разом з мамою та Сніжиками, яких мама ніяк не могла помітити, Юся хутко піднялася на самісіньку вершину та розпакувала гелікоптер`,
  })
  .addSceneChoices({
    nextSceneId: '18',
    description: `Почалася підготовка до польоту`,
  })
  .addChoiceAction({ operator: 'increment', target: 'tophill', value: 1 })
  .addConditionalScene(
    {
      id: `17-1`,
      description: `Після вчорашнього верхівка гори вже не здавалася Юсі такою високою. Разом з мамою та Сніжиками, яких мама ніяк не могла помітити, Юся хутко піднялася на самісіньку вершину та розпакувала гелікоптер`,
    },
    { operator: 'eq', target: 'tophill', value: 2 }
  )
  .addSceneChoices({
    nextSceneId: '18',
    description: `Почалася підготовка до польоту`,
  })
  .addScene({
    id: '18',
    description: `Гелікоптер був не великий, але досить не поганий: з двома гвинтами для кращої стабілізації, зі зручним пультом, який показував кут нахилу та відстань до гелікоптеру. Юся не часто ним літала і він зазвичай лежав без діла, але тепер настала його зоряна мить. Ніхто не сумнівався що все вдасться, тож до випробування підійшли дуже відповідально: утрамбували сніг під злітний майданчик, замінили батарейки на свіжі акумулятори і навіть прив'язали стару панчоху зі снігом, яка мала імітувати вагу Сніжиків.
    Настала відповідальна мить. Юся на хвилинку завмерла, набрала в груди повітря і плавно потягнула важіль висоти.`,
  })
  .addSceneChoices({
    description: `Нічого не відбулося.`,
    nextSceneId: `19`,
  })
  .addScene({
    id: '19',
    description:
      'Найкращий шанс не спрацював. Гелікоптер навіть не зрушив з місця і стояв, наче зачарований. Падав дрібний сніг і всі дивилися на маленьку іграшку, немов сподіваючись, що вона от-от прокинеться. Стояла суцільна тиша. Раптом Юся згадала, що гелікоптер має власний вимикач живлення.',
  })
  .addSceneChoices({
    nextSceneId: '20',
    description:
      'Вже за мить він був увімкнений і Юстина-пілот знову запустила двигуни',
  })
  .addScene({
    id: '20',
    description: `Гвинти гелікоптеру розкрутилися миттєво, наче лише цього й чекали, і він полетів вгору. Гелікоптер швидко набирав висоту і вже за десяток секунд пульт показував майже 50 метрів висоти. Здавалося що все нарешті йде дуже вдало, аж раптом пульт невдоволено пискнув і показав якийсь не дуже зрозумілий значок.`,
  })
  .addSceneChoices({
    nextSceneId: '21',
    description: 'Відстань до гелікоптеру стала зменшуватися',
  })
  .addScene({
    id: '21',
    description: `- Схоже, що ти залетіла занадто далеко. - сказала мама.
    - Але ж мені потрібно ще вище... До самісіньких хмар. - проказала Юся сумно.
    - Тоді тобі потрібно щось інше. - знизала плечами мама`,
  })
  .addSceneChoices({
    description: `І Юся пішла додому`,
    nextSceneId: '22',
  })
  .addScene({
    description: `Прийшовши додому, перше що зробила Юся це поїла. Складні завдання краще вирішувати на ситий шлунок, та й настрій поліпшується. Тим паче, коли їжу готує твоя мама, яка вміє готувати, як ніхто інший`,
    id: '22',
  })
  .addSceneChoices({
    nextSceneId: '23',
    description: 'Порихопивши трохи їжі для Сніжиків, Юся пішла до кімнати',
  })
  .addScene({
    id: '23',
    description: `- Схоже, в мене немає нічого, що могло б доправити вас за хмари. - прошепотіла Юся до Сніжиків. - Але якось же ви потрапили сюди?
    - У нас була повітряна куля з вагами. Коли вага велика, куля летить донизу. Коли вага маленька - її піднімало вгору.
    - Як на моєму дні народженні. - пригадала Юся. - Мені минулого року подарували таку. Я її відпустила і вона полетіла далеко-далеко вгору. Але вона не повернулася і її в мене більше немає.
    - Немає... - наче ехо повторили Сніжики.`,
  })
  .addSceneChoices({
    description: `Раптом Юся пригадала:`,
    nextSceneId: '24',
  })
  .addScene({
    id: '24',
    description: `- Завтра ж день Святого Миколая! Я можу попросити у нього таку кулю і вже завтра ви вирушите додому! Треба лише написати йому листа і передати батькам. От тільки, не знаю, чи встигне Святий Миколай знайти цю кулю. Адже нам потрібна велика та міцна куля! Треба негайно сідати за листа!`,
  })
  .addSceneChoices({
    description: `Юся дістала ручку, папір і почала завзято писати`,
    nextSceneId: `25`,
  })
  .addScene({
    description: `"Любий Святий Миколайу. Подаруй мені кульу велику превелику, щоб до хмар летіла і вниз не падала. І щоби Сніжики (Снілея, Олег та програміст) прилетіли додому."
    Потім вона згадала, що принцеса з книжки завжди додавала щось ввічливе в кінці листа. І дописала:
"Дужедужедужедякуйу."`,
    id: `25`,
  })
  .addSceneChoices({
    nextSceneId: '26',
    description:
      'Залишалося віддати листа мамі щоб вона відправила його Святому Миколаю',
  })
  .addScene({
    id: '26',
    description: `- Мамо, мамо! Я написала листа Святому Миколаєві! Відправ його, будь-ласочка, пошвидше, щоб він встиг прочитати його до завтра.`,
  })
  .addSceneChoices({
    nextSceneId: '27',
    description: `Мама покосилася на коробку, що стояла в кутку кухні, але взяла лист і пообіцяла`,
  })
  .addScene({
    id: '27',
    description: `- Святий Миколай обов'язково прочитає цей лист ще сьогодні. Але залишилося дуже мало часу і він може не встигнути знайти те, що ти хочеш, адже йому потрібно об'їхати всю Україну і всіх дітей.
    - Я розумію. - сказала Юся. - Але мені дуже-дуже треба, щоб у нього все вийшло. Це дуже важливо!
    - Добре, іди роби уроки, а я щось придумаю - відповіла мама і навіщось потягнулася за телефоном, напевне, щоб подзвонити поштареві, аби той пошвидше приїхав.`,
  })
  .addSceneChoices({
    description:
      'Юся хутко переробила всі уроки, прибрала у своїй кімнати і вклалася спати. Завтра мав бути вирішальний день',
    nextSceneId: `28`,
  })
  .addScene({
    id: '28',
    description: `Настав святковий ранок. Прокинувшись, Юся засунула руку під подушку, але там нічого не знайшлося. "-Ну звісно", подумала Юся, куля ж не влізе під подушку! Напевне вона десь в іншому місці. Юся швиденько вдяглася, почистила зуби і пішла на кухню, де мама вже готувала святкові млинці. Млинці пахли корицею і яблуками і втриматися від того щоб відщіпнути від краєчка було просто не можливо.`,
  })
  .addSceneChoices({
    nextSceneId: '29',
    description: ` Мамо, ти встигла відправити листа? Святий Миколай його отримав? - швидко проговорила Юся.`,
  })
  .addScene({
    id: '29',
    description: `Мама посміхнулася.
    - Та встигла, встигла. Але поки що тобі няких пакунків не надходило. Але думається мені, що все ще попереду. Не так то й просто, - раптом мама зупинилася на хвильку а тоді продовжила, - обійти усіх дітей.`,
  })
  .addSceneChoices({
    description: 'Аж тут хтось постукав у двері',
    nextSceneId: '30',
  })
  .addScene({
    id: '30',
    description: `Юся швиденько відчинила двері і побачила батька, який тримав в руках величезну рожеву кулю у формі серця. Він подивився на доньку і сказав:
- Хтось залишив це прямо під нашими дверима. Не знаєш для кого це?
- Це мені, мені! Дякую! Це Святий Миколай приніс!, - радісно прокричала Юстя. 
Вона забрала кулю з рук батька і віднесла її у кімнату, де її вже чекали Сніжики`,
  })
  .addSceneChoices({
    description: `Нам вдалося! - ледь стримуючи радість прошепотіла вона`,
    nextSceneId: '31',
  })
  .addScene({
    id: '31',
    description: `Через декілька годин вся родина, разом зі Сніжиками та Кулею були на знайомій нам гірці. Куля зазнала деяких змін і тепер мала під низом невеличкий кошик (кавовий стаканчик), в якому вмостилися Сніжики. Олегу було не дуже зручно, але Сніжики запевнили, що летіти не так далеко, тож вони готові потерпіти. Юся не хотіла відпускати Сніжиків від себе, адже разом з їх відльотом мала скінчитися і її казка, але вона чудово розуміла, що Сніжики мають свої власні сім'ї, які дуже на них чекають. Тож вона знайшла в собі сили посміхнутися і тихесенько прошепотіла:
    - Я буду сумувати за вами. Вдалого польоту!`,
  })
  .addSceneChoices({
    description: 'А тоді відпустила кулю і Сніжики полетіли додому',
    nextSceneId: `32`,
  })
  .addScene({
    id: `32`,
    description: `Прийшов вечір. Юсі було сумно без її нових друзів, але одначасно вона пишалася собою, адже саме вона допомогла Сніжикам дістатися до дому і, цілком можливо, врятувала сніг на Різдво, а це, погодьтеся, велике досягнення для маленької дитини.`,
  })
  .addSceneChoices({
    nextSceneId: '33',
    description: 'Раптом вона почула як щось стукнуло у вікно її кімнати',
  })
  .addScene({
    description: `Юся підійшла до вікна і побачила на склі візерунок, що нагадував Сніжиків. А ще йшов густий прегустий сніг, і цього разу він йшов рівнесенько, наче політ кожної крижинки було кимось ретельно обраховано.`,
    id: '33',
  })
  .addSceneChoices({
    description:
      'Юся посміхнулася. Схоже, її нові друзі успішно дісталися додому',
    nextSceneId: `34`,
  })
  .addScene({
    description: 'Kінець',
    id: '34',
  })
  .build();
